{
  "presentations": [
    {
      "name": "Contributing to Open Source Workshop",
      "location": "CopenhagenJS - 4. Sep 2018",
      "description": "A workshop about how to contribute to open source and some workshop questions to think about and discuss in a group. Finish it up with time for starting that process.",
      "links": [["Slides", "https://www.slideshare.net/KevinSimper/contributing-opensource-workshop"]],
      "type": "workshop"
    },
    {
      "name": "Using React-Native to launch iOS and Android in record time",
      "location": "Copenhagen Cocoa - 23. August 2018",
      "description": "We made a React-Native app at Connected Cars, but how did it go and what are the upsides and downsides now after it has been launched? What could be done better?"
    },
    {
      "name": "Greeting you with Vision and Speech Machine Learning",
      "location": "GDG Cloud London - 22. August 2018",
      "description": "I talked about how you can use Machine Learning for recognizing faces and names with Machine Learning."
    },
    {
      "name": "Docker Best Practices in development and Production",
      "location": "Gr8Conf - 31. May 2018",
      "description": "You should come if you know or have tried Docker but are thinking about how to get more serious about containers. What are the best practices with docker in Development, Staging and Production with regards to security.",
      "links": [["Slides", "https://www.slideshare.net/KevinSimper/making-docker-and-kubernetes-a-success-at-your-company"]]
    },
    {
      "name": "Making Docker and Kubernetes a success at your Company",
      "location": "Gr8Conf - 31. May 2018",
      "description": "We will talk about the benefits and downsides of using Kubernetes and how to take docker and kubernetes from theory to practice as your company. Story of how we took Connected Cars from nothing to a full self-serving platform in one year.",
      "links": [["Slides","https://www.slideshare.net/KevinSimper/docker-best-practices-in-development-and-production"]]
    },
    {
      "name": "WebVR with the Oculus Go",
      "location": "CopenhagenJS - 24. May 2018",
      "description": "How does the Oculus Go work and what is WebVR together with it? Making a duck shooting game in 2 hours."
    },
    {
      "name": "How to stay secure/anonymouse in a modern age",
      "location": "WonderCoders - 26. October 2017",
      "description": "I gave a 20 minutes presentation about how to communicate and browse securely, how to use tor and using encryption easily with Keybase.io"
    },
    {
      "name": "Serverless workshop",
      "location": "CopenhagenJS - 23. October 2017",
      "description": "I gave a practical workshop on how to use AWS Lambda and API Gateway where everybody got to deploy their own serverless workshop.",
      "type": "workshop"
    },
    {
      "name": "What I learned teaching workshops",
      "location": "DockerCon Europe Organizer Summit - 16. October 2017",
      "description": "I gave a talk about what I learned giving workshops at the Docker meetup group and some tips and tricks to do it better."
    },
    {
      "name": "How to not burn out as a Organizer",
      "location": "Copenhagen Tech Week - 16. October 2017",
      "description": "A talk about learning and ideas for being a meetup organizer through my experience running CopenhagenJS and Docker Copenhagen for 3 years."
    },
    {
      "name": "What is Cloud Native",
      "location": "Docker Copenhagen - 3. August 2017",
      "description": "A gave a 25 min presentation about Cloud Native and what it means."
    },
    {
      "name": "Introduction to Docker",
      "location": "Docker Copenhagen - 13. July 2017",
      "description": "I gave a 2 hours introduction to docker and a live code demo."
    },
    {
      "name": "Creating an intelligent Facebook bot",
      "location": "Copenhagen JavaScript - 19. January 2017",
      "description": "I showed how to make a facebook messenger bot that used speech recognition."
    },
    {
      "name": "How to be an awesome developer and get paid well at the same time!",
      "location": "ITU Innovators - 6. October 2016",
      "description": "What does it take to be an awesome developer and how do you ensure you get paid well."
    },
    {
      "name": "Learn to be a DevOps - Workshop",
      "location": "Docker Copenhagen - 4. October 2016",
      "description": "A workshop that teaches the flow of continuous integration and continuous deployment.",
      "type": "workshop"
    },
    {
      "name": "Distributed file system with IPFS",
      "location": "Foo Cafe Copenhagen - 19. September 2016",
      "description": "A presentation about distributed hash tables, hashing of files and hands on use of IPFS."
    },
    {
      "name": "React Workshop",
      "location": "React Lima, Peru - 14. June 2016",
      "description": "Made a workshop on how to get started with React and the attendees made a contact formular.",
      "type": "workshop"
    },
    {
      "name": "Universal Apps - The good, the bad and the ugly",
      "location": "React Lima, Peru - 14. June 2016",
      "description": "My experiences on developing universal apps and what to do and what not to do."
    },
    {
      "name": "How to deploy with Docker",
      "location": "Cusco Developer Group, Peru - May 2016",
      "description": "I showed how to deploy a website from scracth with Docker."
    },
    {
      "name": "Docker Introduction - What you need to know",
      "location": "IT University of Copenhagen - Marts 2016",
      "description": "Talked about why Docker matters and the reason why it is a billion dollar company. Showed a demo on how to use Docker."
    },
    {
      "name": "Swarm 1.1 release and Introduction",
      "location": "Docker Copenhagen - Marts 2016",
      "description": "Showed the newest version of Docker, including that of rescheduling of containers."
    },
    {
      "name": "Kubernetes Introduction - Workshop 3 hours",
      "location": "Docker Copenhagen - February 2016",
      "description": "Made a workshop with 5 scenarios on how to use Kubernetes, from launching a Kubernetes cluster on your own computer to the hardest scenario of launching a fault-tolerant Redis cluster.",
      "type": "workshop"
    },
    {
      "name": "Introduction to HTML and CSS",
      "location": "Codher Introduction Weekend - January 2016",
      "description": "Prepared a introduction to learn a group of girls how to think in HTML, \"everything is a square\" and the semantic of html tags.",
      "type": "workshop"
    },
    {
      "name": "How do you survive key-loss with Docker?",
      "location": "Docker Copenhagen - January 2016",
      "description": "Gave a thorough guide on how docker hub can survive a key loss with their Docker Notary project. Talking about how they switch out root keys and their standard they have published."
    },
    {
      "name": "JavaScript Jeopardy",
      "location": "CopenhagenJS - January 2016",
      "description": "Prepared a 30 multiple-choice about everything from founders of projects to how to change the inline style of a element with basic JavaScript."
    },
    {
      "name": "Introduction to Docker - Workshop",
      "location": "Docker Copenhagen - December 2015",
      "description": "Gave a 3-hour introduction to Docker about everything you need to know. We talked about why it mattered and how to get started with Docker on their next project."
    },
    {
      "name": "The land of Isomorphic Apps",
      "location": "CopenhagenJS - November 2015",
      "description": "Talked about my experience creating a universal app. What to do and especially what not to do!"
    },
    {
      "name": "Face Recognition on old pictures",
      "location": "Hack4DK - October 2015",
      "description": "During a hackathon, I worked on doing facial recognition and then gave a presentation on what I found interesting with the results and how to get started with it."
    },
    {
      "name": "Introduction to webtorrent",
      "location": "Copenhagen Frontenders - August 2015",
      "description": "I had been hacking around with webtorrent and gave a talk about this project. I showed some small projects that I have made and explained the concept of webtorrent and what made it work."
    },
    {
      "name": "Lessons learnt building with Reflux.js",
      "location": "CopenhagenJS - May 2015",
      "description": "I talked about lesson learned working with Reflux.js, a simple flux implementation. I showed why a unidirectional flow was a positive thing for both the development and debugging part of web development."
    },
    {
      "name": "Docker Hosting - How to ship those containers?",
      "location": "Docker Copenhagen - February 2015",
      "description": "We all love containers, but what are the actually easiest ways to get started hosting those containers online. I showed an example on how to get started with hosting containers on Tutum (now Docker Cloud)."
    },
    {
      "name": "Firespeed prototyping with Firebase",
      "location": "CopenhagenJS - April 2014",
      "description": "I had been working on Firebase some time and showed how it was awesome for small and quick prototypes where you wanted something awesome quick."
    },
    {
      "name": "20 minutes Super Mario",
      "location": "CopenhagenJS - Februar 2014",
      "description": "I showed how you could build a Super Mario clone in literally 20 minutes of time with Crafty.js and all the built in modules."
    }
  ]
}
