{
  "experiences": [
    {
      "company": "Ravn IT",
      "location": "Snebærvej 11, 4200 Slagelse, Denmark",
      "start": "02/2012",
      "end": "03/2013",
      "title": "Web Developer",
      "description": "I worked as a consultant, helping existing and new customers with their website and intranets. I got Google Adwords certified and succesfully got new customer that wanted IT support."
    },
    {
      "company": "Gorm Larsen & Zornig",
      "location": "Hillerødgade 30, 2200 København N, Denmark",
      "start": "04/2013",
      "end": "05/2014",
      "title": "Front-end Developer",
      "description": "I worked as a front-end developer on a advertising agency, helping my primary customer DONG Energy A/S with everything front-end related on their website, www.dongenergy.dk. I did the change of the frontpage, online contents, help pages and the whole new product section about their new electric thermostat."
    },
    {
      "company": "Blackwood Seven A/S",
      "location": "Livjægergade 17B, 2100 København, Denmark",
      "start": "06/2014",
      "end": "08/2014",
      "title": "Senior Developer",
      "description": "I was hired to help them building their automated adversiting placement backend, which included a lot of JavaScript with Backbone.js. I worked a lot on improving the development experience of reproducible enviroments."
    },
    {
      "company": "Graduateland",
      "location": "Njalsgade 19, 2300 København, Denmark",
      "start": "09/2014",
      "end": "06/2015",
      "title": "Lead Front-end Developer",
      "description": "I was hired as Lead front-end developer, redid the whole profile page with React.js that ended up with more than 100 modules. I was responsible for the development environments. Optimized CSS style generation time from minutes to seconds."
    },
    {
      "company": "Blackbeard",
      "location": "Njalsgade 19, 2300 København, Denmark",
      "start": "07/2015",
      "end": "09/2016",
      "title": "CEO / Full Stack Developer",
      "description": "I started a company together with my friend where we created a hosting platform based on Docker. We were interviewed by Y-Combinator for the idea S15. We built it with Node.js, React.js, Mongo, RabbitMQ."
    },
    {
      "company": "Connected Cars",
      "location": "Banemarksvej 2B, 2600 Glostrup, Denmark",
      "start": "10/2016",
      "end": "",
      "title": "CTO / Full Stack Developer",
      "description": "Started from the start working on making a platform for Connected Cars for Volkswagen, Audi, Skoda and Volkswagen. It is built with Node.js and React and deployed with Docker and Kubernetes."
    }
  ]
}
